In [1]:
# The pandas library essentially has three data structures:
# 1. Series
# 2. DataFrame
# 3. Panel

In [2]:
import pandas as pd
import numpy as np
pd.Series(np.random.randn(5))
# The random.randn parameter is part of the NumPy package and it
# generates random numbers. The series function creates a pandas series
# that consists of an index, which is the first column, and the second
# column consists of random values. At the bottom of the output is the
# datatype of the series.

0    0.441826
1    0.625807
2    0.895773
3    1.102327
4    1.847269
dtype: float64

In [3]:
# The index of the series can be customized by calling the following:
pd.Series(np.random.randn(5), index = ['a', 'b', 'c', 'd', 'e'])

a   -0.378365
b   -0.207199
c   -0.137651
d   -1.381768
e   -0.508264
dtype: float64

In [4]:
# A series can be derived from a Python dict too:
d = {'A':10, 'B':20, 'C':30}
pd.Series(d)

A    10
B    20
C    30
dtype: int64

In [5]:
# DataFrame is a 2D data structure with columns that can be of different
# datatypes. It can be seen as a table. A DataFrame can be formed from
# the following data structures:
# A NumPy array
# Lists
# Dicts
# Series
# A 2D NumPy array

In [6]:
# A DataFrame can be created from a dict of series by calling the following
# commands:
d = {'c1': pd.Series(['A', 'B', 'C']), 'c2': pd.Series([1, 2, 3, 4])}
df = pd.DataFrame(d)
df

    c1  c2
0    A   1
1    B   2
2    C   3
3  NaN   4

In [7]:
# The DataFrame can be created using a dict of lists too:
d = {'c1': ['A', 'B', 'C', 'D'], 'c2': [1, 2.0, 3.0, 4.0]}
df = pd.DataFrame(d)
df

  c1   c2
0  A  1.0
1  B  2.0
2  C  3.0
3  D  4.0

In [8]:
# A Panel is a data structure that handles 3D data. The following command
# is an example of panel data:
d = {'Item1' : pd.DataFrame(np.random.randn(4,3)), 'Item2' : pd.DataFrame(np.random.randn(4, 2))}
pd.Panel(d)
# The preceding command shows that there are 2 DataFrames
# represented by two items. There are four rows represented by four major
# axes and three columns represented by three minor axes.

/home/apoorva/anaconda3/lib/python3.7/site-packages/IPython/core/interactiveshell.py:3325: FutureWarning:
Panel is deprecated and will be removed in a future version.
The recommended way to represent these types of 3-dimensional data are with a MultiIndex on a DataFrame, via the Panel.to_frame() method
Alternatively, you can use the xarray package http://xarray.pydata.org/en/stable/.
Pandas provides a `.to_xarray()` method to help automate this conversion.

  exec(code_obj, self.user_global_ns, self.user_ns)

<class 'pandas.core.panel.Panel'>
Dimensions: 2 (items) x 4 (major_axis) x 3 (minor_axis)
Items axis: Item1 to Item2
Major_axis axis: 0 to 3
Minor_axis axis: 0 to 2

In [9]:
# To write a data to the .csv file, the following to_csv function can be used:
d = {'c1': pd.Series(['A', 'B', 'C']), 'c2': pd.Series([1, 2., 3., 4.])}
df = pd.DataFrame(d)
df.to_csv('sample_data.csv')

In [10]:
# To read the data from a JSON file, Python's standard json package can
# be used. The following commands help in reading the file:
# import json
# json_data =
# open('Data/Student_Weight_Status_Category_Reporting_Results__Beginning_2010.json')
# data = json.load(json_data)
# json_data.close()
# In the preceding command, the open() function opens a connection to the
# file. The json.load() function loads the data into Python. The
# json_data.close() function closes the connection to the file.
# The pandas library also provides a function to read the JSON file, which
# can be accessed using pd.read_json() .

In [11]:
# Database
# To read data from a database, the following function can be used:
# >>> pd.read_sql_table(table_name, con)
# The preceding command generates a DataFrame. If a table name and an
# SQLAlchemy engine are given, they return a DataFrame. This function
# does not support the DBAPI connection. The following are the description
# of the parameters used:
# table_name : This refers to the name
# con : This refers to the SQLAlchemy of the SQL table in a database
# engine
# The following command reads SQL query into a DataFrame:
# >>> pd.read_sql_query(sql, con)
# The following are the description of the parameters used:
# sql : This refers to the SQL query that is to be executed
# con : This refers to the SQLAlchemy engine

In [12]:
# to check if the location column has missing
# value, the following command can be utilized:
# >>> d['Location 1'].isnull()
# 0 False
# 1 False
# 2 False
# 3 False
# 4 False
# 5 False
# 6 False

In [13]:
# To remove the rows, execute the following command:
# >>> d = d['Location 1'].dropna()
# To remove all the rows with an instance of missing values, use the
# following command:
# >>> d = d.dropna(how='any')

In [14]:
df2 = pd.DataFrame(np.random.randn(5, 3), index = ['a0', 'a10', 'a20', 'a30', 'a40'], columns=['X', 'Y', 'Z'])

In [15]:
df2

            X         Y         Z
a0   0.866531  0.673036 -1.428936
a10 -0.958417  0.212438  0.700142
a20 -0.690858  0.534668 -1.072700
a30  1.077827 -1.640559 -0.329707
a40  0.996985  0.340751  0.655725

In [16]:
df2 = df2.reindex(['a0', 'a1', 'a10', 'a11', 'a20', 'a21', 'a30', 'a31', 'a40', 'a41'])
df2

            X         Y         Z
a0   0.866531  0.673036 -1.428936
a1        NaN       NaN       NaN
a10 -0.958417  0.212438  0.700142
a11       NaN       NaN       NaN
a20 -0.690858  0.534668 -1.072700
a21       NaN       NaN       NaN
a30  1.077827 -1.640559 -0.329707
a31       NaN       NaN       NaN
a40  0.996985  0.340751  0.655725
a41       NaN       NaN       NaN

In [17]:
df2.fillna(0)

            X         Y         Z
a0   0.866531  0.673036 -1.428936
a1   0.000000  0.000000  0.000000
a10 -0.958417  0.212438  0.700142
a11  0.000000  0.000000  0.000000
a20 -0.690858  0.534668 -1.072700
a21  0.000000  0.000000  0.000000
a30  1.077827 -1.640559 -0.329707
a31  0.000000  0.000000  0.000000
a40  0.996985  0.340751  0.655725
a41  0.000000  0.000000  0.000000

In [18]:
# If you want to fill the value with forward propagation, which means that
# the value previous to the null value in the column will be used to fill the
# null value, the following command can be used:
df2.fillna(method = 'pad')

            X         Y         Z
a0   0.866531  0.673036 -1.428936
a1   0.866531  0.673036 -1.428936
a10 -0.958417  0.212438  0.700142
a11 -0.958417  0.212438  0.700142
a20 -0.690858  0.534668 -1.072700
a21 -0.690858  0.534668 -1.072700
a30  1.077827 -1.640559 -0.329707
a31  1.077827 -1.640559 -0.329707
a40  0.996985  0.340751  0.655725
a41  0.996985  0.340751  0.655725

In [19]:
# If you want to fill the null values of the column with the column mean,
# then the following command can be utilized:
df2.fillna(df2.mean())

            X         Y         Z
a0   0.866531  0.673036 -1.428936
a1   0.258413  0.024067 -0.295095
a10 -0.958417  0.212438  0.700142
a11  0.258413  0.024067 -0.295095
a20 -0.690858  0.534668 -1.072700
a21  0.258413  0.024067 -0.295095
a30  1.077827 -1.640559 -0.329707
a31  0.258413  0.024067 -0.295095
a40  0.996985  0.340751  0.655725
a41  0.258413  0.024067 -0.295095

In [20]:
# In order to extract the first word from the Area Name column, we'll use the
# extract function as shown in the following command:
# >>> df['AREA NAME'][0:5].str.extract('(\w+)')
# 0 RAVENA
# 1 RAVENA
# 2 RAVENA
# 3 COHOES
# 4 COHOES
# Name: AREA NAME, dtype: object
# In the preceding command, the str attribute of the series is utilized. The
# str class contains an extract method, where a regular expression could
# be fed to extract data, which is very powerful. It is also possible to extract
# a second word in AREA NAME as a separate column:
# >>> df['AREA NAME'][0:5].str.extract('(\w+)\s(\w+)')
# 0
# 1
# 0 RAVENA COEYMANS
# 1 RAVENA COEYMANS
# 2 RAVENA COEYMANS
# 3 COHOES
# CITY
# 4 COHOES
# CITY
# To extract data in different columns, the respective regular expression
# needs to be enclosed in separate parentheses.

In [21]:
# Filtering: If we want to filter rows with data on ELEMENTARY school, then
# the following command can be used:
# >>> df[df['GRADE LEVEL'] == 'ELEMENTARY']

In [22]:
# df['AREA NAME'][0:5].str.upper()
# df['AREA NAME'][0:5].str.lower()
# df['AREA NAME'][0:5].str.len()

In [23]:
# Split: To split Area Name based on a whitespace, we'll use the following
# >>> df['AREA NAME'][0:5].str.split(' ')

In [24]:
# # Replace: If we want to replace all the area names ending with DISTRICT
# # to DIST , then the following command can be used:
# # >>> df['AREA NAME'][0:5].str.replace('DISTRICT$','DIST')
# The first argument in the replace method is the regular expression used
# to identify the portion of the string to replace. The second argument is the
# value for it to be replaced with.

In [25]:
# Average: To find out the average number of students in the
# ELEMENTARY school who are obese, we'll first filter the ELEMENTARY data
# with the following command:
# >>> data = d[d['GRADE LEVEL'] == 'ELEMENTARY']
# 213.41593780369291
# Now, we'll find the mean using the following command:
# >>> data['NO. OBESE'].mean()
# The elementary grade level data is filtered and stored in the data object.
# The NO. OBESE column is selected, which contains the number of obese
# students and using the mean() method, the average is taken out.

In [26]:
# SUM: To find out the total number of elementary students who are
# obese across all the school, use the following command:
# >>> data['NO. OBESE'].sum()
# 219605.0
# MAX: To get the maximum number of students that are obese in an
# elementary school, use the following command:
# >>> data['NO. OBESE'].max()
# 48843.0
# MIN: To get the minimum number of students that are obese in an
# elementary school, use the following command:
# >>> data['NO. OBESE'].min()
# 5.0
# STD: To get the standard deviation of the number of obese students,
# use the following command:
# >>> data['NO. OBESE'].std()
# 1690.3831128098113
# COUNT: To count the total number of schools with the ELEMENTARY
# grade in the DELAWARE county, use the following command:
# >>> data = df[(d['GRADE LEVEL'] == 'ELEMENTARY') &
# (d['COUNTY'] == 'DELAWARE')]
# >>> data['COUNTY'].count()
# 19
# The table is filtered for the ELEMENTARY grade and the DELAWARE county.
# Notice that the conditions are enclosed in parentheses. This is to ensure
# that individual conditions are evaluated and if the parentheses are not
# provided, then Python will throw an error.